Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes.AlongPartCenteredPlacingType Method
 The object is placed using the along line placing. The line used will be the part's edge in the center of that line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase AlongPartCenteredPlacingType()
Public Shared Function AlongPartCenteredPlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new along part centered placing type instance.
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace